app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 7]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 7]]
---
              <p><%= post.content %></p>
              <p><%= link_to 'Göster', post %> ( <%= post.likes.count %> beğeni , <%= post.comments.count %>   yorum )</p>