app/views/posts/show.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 7]]
---
  <% @ifLiked = 0  %>
   <% @post.likes.each do |like| %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 7]]
---
              <p><%= @post.content %></p>
              <p><%= @post.likes.count %> Likes</p>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
              <h2 >Yorumlar</h2>
              <% @post.comments.each do |comment| %>