app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("comm", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comm", "sss"], ["post_id", 1], ["created_at", "2016-05-13 15:21:18.368902"], ["updated_at", "2016-05-13 15:21:18.368902"]]
UPDATE "comments" SET "userName" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["userName", "optimus"], ["updated_at", "2016-05-13 15:21:18.394265"], ["id", 1]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
    @comment.userName = current_user.nick
    if @comment.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
  def destroy
    @post = Post.find(params[:post_id])
    @comment.destroy