app/controllers/likes_controller.rb

  def index
    @likes = Like.all
---
SELECT "likes".* FROM "likes"

  def create
    @post = Post.find(params[:post_id])
    @like = @post.likes.create(like_params)
    @like.userNameLiked = current_user.nick

    if @like.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "likes" ("post_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["post_id", 7], ["created_at", "2016-05-16 10:27:23.704157"], ["updated_at", "2016-05-16 10:27:23.704157"]]
UPDATE "likes" SET "userNameLiked" = ?, "updated_at" = ? WHERE "likes"."id" = ?  [["userNameLiked", "herbie"], ["updated_at", "2016-05-16 10:27:23.727789"], ["id", 1]]

  def destroy
    @post = Post.find(params[:post_id])
    @like.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]

    def set_like
      @like = Like.find(params[:id])
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT 1  [["id", 1]]