app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ilk baslik"], ["content", "asdassadas"], ["user_id", 1], ["created_at", "2016-05-12 16:20:26.118714"], ["updated_at", "2016-05-12 16:20:26.118714"]]
---
  def create
    @post = current_user.posts.build(post_params)

    if @post.save