app/controllers/sessions_controller.rb

  def create
    user = User.find_by_nick(params[:nick])
---
SELECT  "users".* FROM "users" WHERE "users"."nick" = ? LIMIT 1  [["nick", "herbie"]]